Revit 2027 API
DirectShape.AddReferenceCurve Method
Overload List
Name | Description
AddReferenceCurve(Curve) |  Adds a reference curve to the DirectShape.
AddReferenceCurve(Curve, DirectShapeReferenceOptions) |  Adds a reference curve to the DirectShape.
Top
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace